###################################################################

# Created by write_sdc on Tue Nov 21 18:43:12 2023

###################################################################
set sdc_version 2.1

set_units -time ns -resistance MOhm -capacitance fF -voltage V -current mA
set_load -pin_load 3.40189 [get_ports {Y[9]}]
set_load -pin_load 3.40189 [get_ports {Y[8]}]
set_load -pin_load 3.40189 [get_ports {Y[7]}]
set_load -pin_load 3.40189 [get_ports {Y[6]}]
set_load -pin_load 3.40189 [get_ports {Y[5]}]
set_load -pin_load 3.40189 [get_ports {Y[4]}]
set_load -pin_load 3.40189 [get_ports {Y[3]}]
set_load -pin_load 3.40189 [get_ports {Y[2]}]
set_load -pin_load 3.40189 [get_ports {Y[1]}]
set_load -pin_load 3.40189 [get_ports {Y[0]}]
set_load -pin_load 3.40189 [get_ports VOUT]
create_clock [get_ports CLK]  -name MY_CLK  -period 12  -waveform {0 6}
set_clock_uncertainty 0.07  [get_clocks MY_CLK]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports RST_N]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports VIN]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {A1[9]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {A1[8]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {A1[7]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {A1[6]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {A1[5]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {A1[4]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {A1[3]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {A1[2]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {A1[1]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {A1[0]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {B0[9]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {B0[8]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {B0[7]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {B0[6]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {B0[5]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {B0[4]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {B0[3]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {B0[2]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {B0[1]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {B0[0]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {B1[9]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {B1[8]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {B1[7]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {B1[6]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {B1[5]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {B1[4]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {B1[3]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {B1[2]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {B1[1]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {B1[0]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {X[9]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {X[8]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {X[7]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {X[6]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {X[5]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {X[4]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {X[3]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {X[2]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {X[1]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {X[0]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {Y[9]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {Y[8]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {Y[7]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {Y[6]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {Y[5]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {Y[4]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {Y[3]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {Y[2]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {Y[1]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {Y[0]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports VOUT]
